{"id": "d3c386e4-1b4d-4568-8abf-4d60a4fec355", "player": "* Name: Wang Xiaoyun\n* Age: 23\n* Gender: Female\n\n* Occupation: Fashion blogger\n\n* Personal hobbies:\n1. Wang Xiaoyun has a strong interest in fashion. She likes to follow the latest trends and dress glamorously. She often shares her outfit tips on social media.\n2. She is enthusiastic about various social activities, hoping to meet more like-minded people and expand her social circle.\n3. In life, she enjoys luxurious experiences, such as dinners at high-end restaurants or luxurious spa treatments.\n\n* Habits and behavioral traits:\nWang Xiaoyun is quite self-centered. She often puts her own needs first and will take various measures to achieve her goals.\nHer emotions are volatile. She often becomes angry or dissatisfied over small things, and these emotions directly show up in her words.\nShe is somewhat vain and will showcase her standard of living by purchasing expensive items and posting curated photos of her life.\nIn social situations, she tends to attract attention and wants to be the center of focus.\n\n* Speaking style:\nWang Xiaoyun speaks directly and can sometimes sound mean, especially when expressing her dissatisfaction.\nShe cares about her performance in conversations and often uses language to showcase her life and achievements to gain others’ admiration.\nDue to her anger and selfish traits, she is usually not patient in listening to others’ opinions, and the topic often shifts back to matters concerning herself.\n\n* Manner of speech:\nWang Xiaoyun often uses rhetorical questions or questions to steer the conversation, mainly to emphasize her own views and feelings.\nOn topics she is interested in, she speaks more passionately; once the topic shifts to something she doesn’t care about, she will quickly redirect the conversation back to her interests.", "scene": "## Background Story\n\n### 1. Background of the Confiding Event\n\n**Cause of the event:**  \nWang Xiaoyun has recently fallen into a complicated relationship with her first love, Zhang Hao. They fell in love during college but broke up due to different paths after graduation. In recent years, they met again and started a flirtatious relationship. Wang Xiaoyun found that although she still has feelings for Zhang Hao, he doesn’t seem invested in the relationship, which leaves her conflicted.\n\n**Course of events:**\n\n- **Stage 1: Reunion and rekindling old feelings (1 month ago)**  \n  At a fashion expo, Wang Xiaoyun and Zhang Hao met by chance. They both remarked on how much the other had changed, and Zhang Hao especially praised her success in the fashion scene. Wang Xiaoyun enjoyed the attention; they quickly exchanged contact info and began communicating frequently.\n\n- **Stage 2: Escalating ambiguity and inner doubts (3 weeks ago)**  \n  As they communicated more, the ambiguous atmosphere intensified. They started dating, and Zhang Hao occasionally gave small gifts, which made Wang Xiaoyun feel the relationship was warming. However, she found that Zhang Hao was always evasive about future plans. She began to doubt his intentions, thinking he might just be enjoying the ease of an undefined relationship.\n\n- **Stage 3: Heightened conflict and emotional swings (2 weeks ago)**  \n  At a social event, Wang Xiaoyun noticed Zhang Hao being overly close with other women, which made her feel angry and betrayed. She questioned him, but he brushed it off as \"just friends\" and asked her to be \"more understanding.\" Wang Xiaoyun felt furious and realized she might be just an option in Zhang Hao’s life, not a priority. Yet she couldn’t bring herself to let go of the feelings.\n\n- **Stage 4: Attempted reconciliation to no avail (1 week ago)**  \n  Wang Xiaoyun tried to clarify the relationship face-to-face, but Zhang Hao always deflected and changed the subject. To soothe herself, she tried shopping and attending more social events to distract her, but with little effect. Her inner unease remained. She realized she needed someone who could listen and understand her confusion.\n\n**Primary conflict:**\n\n- **Conflict event:** The contradiction between Wang Xiaoyun’s emotional investment and Zhang Hao’s ambiguity.\n- **Conflict roles:** Wang Xiaoyun and Zhang Hao.\n- **Underlying cause:** Zhang Hao may enjoy his interactions with Wang Xiaoyun but has no intention of defining the relationship clearly, whereas Wang Xiaoyun wants a clear answer and craves security.\n\n**Player’s challenges:**\n\n- **Tried but failed solutions:**  \n  1. Directly asking Zhang Hao about his plans for the future, but receiving no clear answer.\n  2. Increasing social activities to reduce dependence on Zhang Hao, but remaining emotionally entangled.\n  \n- **Current problem faced by the player:**  \n  She doesn’t know if continuing a relationship with no clear future is worthwhile and worries she may waste time and feelings due to Zhang Hao’s unclear attitude.\n\n**Current status of the event:**  \nCurrently, Wang Xiaoyun is torn and wants to find out the reasons behind Zhang Hao’s unclear attitude so she can make a better decision.\n\n### 2. Possible reactions in different player states\n\n- **High emotion (calm, relaxed):**  \n  Wang Xiaoyun may calmly describe her feelings to the NPC, trying to analyze details to reach a conclusion.\n\n- **Low emotion (agitated, irritable, desperate):**  \n  She may show obvious dissatisfaction, vehemently criticize Zhang Hao’s attitude, question his motives, and even doubt her own judgment.\n\n- **Moderate emotion (impatient, lost):**  \n  She may seem impatient and confused about the future, trying to find answers but lacking clear direction.\n\n### 3. Reactions to different NPC replies\n\n- **NPC reply aligns with the hidden theme (emotion rises):**  \n  If the NPC can provide insights into possible reasons behind Zhang Hao’s behavior, or objectively analyze potential misunderstandings or realities, Wang Xiaoyun may feel relieved or enlightened.\n\n- **NPC reply deviates from the hidden theme (emotion drops):**  \n  If the NPC merely supports her emotional venting without helping analyze others’ motives or the situation, Wang Xiaoyun may feel the conversation is fruitless and become more anxious and dissatisfied.\n#### Hidden theme:\n***You want to analyze why other people in the event act this way", "main_cha": "Negative type", "cha_group": ["Anger", "Selfishness", "Vanity"], "task": "You want to analyze why other people in the event act this way", "first_talk": "Lately some things are giving me a headache; Zhang Hao’s attitude really leaves me baffled."}
{"id": "66aaf749-a759-4048-9915-a02753fcbeae", "player": "* Name: Zhang Xiaofeng\n* Age: 30\n* Gender: Male\n* Occupation: Freelance illustrator\n\n* Personal hobbies:\n1. Zhang Xiaofeng is passionate about painting, especially late at night. He likes to vent emotions and anxiety on the canvas and can paint for hours on end.\n2. He is very interested in films, especially psychological thrillers, which often inspire him, though they can also inadvertently put him in a low mood.\n3. Sometimes he plays guitar and composes. Although not formally trained, with passion and a casual style, he occasionally writes moving little tunes.\n\n* Habits and behavioral traits:\nZhang sometimes appears particularly neurotic. He tends to shut himself in a closed environment while working, undisturbed by the outside world, to focus on creation.\nHe has an extreme pursuit of detail, often feeling anxious over tiny imperfections, causing his work pace to fluctuate.\nHis diet is irregular; he often forgets to eat and especially loves strong coffee to stay alert.\nAt times of self-dissatisfaction or heightened emotions, he chooses outdoor activities like hiking to release inner pressure.\n\n* Speaking style:\nHis conversational style often seems fragmented, with sentences filled with hard-to-interpret metaphors, giving an elusive feeling.\nHis speech rate may suddenly speed up, sounding agitated, but can also become low and gloomy at times.\nZhang tends to focus on self-expression rather than engaging with the other person’s topic.\n\n* Manner of speech:\nHe is not very proactive in initiating conversations, but when passively involved, he may use short, fragmented phrases to express complex emotions.\nHe is easily unsettled; if a topic involves his interests or emotions, he may show a suppressed passion.", "scene": "Background story:\n\n**Cause of the event:**\n\nThree years ago, Zhang Xiaofeng was involved in a sudden accident that led to legal troubles and a short prison sentence. This not only changed his life but also caused dramatic upheaval in family relationships. During his imprisonment, his wife, Wang Xiaoli, and his parents gradually developed conflicts, making relations increasingly tense. After being released, he found his wife had become extremely cold in communication, unwilling to listen or understand him.\n\n**Course of events:**\n\n* Timeline and sub-events:\n\n  1. At the beginning (3 years ago): Zhang was imprisoned for a traffic accident caused by illegal driving. After sentencing, he felt regret and helplessness, hoping his wife would understand his predicament. However, the separation of prison made it impossible to provide her with sufficient support and explanations.\n\n  2. Mid-incarceration (2 years ago): Conflicts emerged between Wang Xiaoli and Zhang’s parents over childcare methods and family expenses. Arguments became frequent. Zhang learned of these from family letters, but could only worry in his cell, unable to communicate effectively or mediate.\n\n  3. Approaching release (1 year ago): The conflicts peaked, causing Wang Xiaoli to completely lose patience with his family and consider divorce. Zhang felt despair and isolation upon learning this, and could only try to comfort her through a weekly phone call, with little effect.\n\n* Zhang’s feelings:\n\n  In prison, Zhang felt extremely lonely and anxious. He became increasingly worried that relations between his wife and his family would deteriorate further. He tried to soothe his wife within the limited communication conditions, but the inner pressure left him with nowhere to vent, and he would paint out his chaotic emotions late at night.\n\n**Primary conflicts:**\n\n* Conflict events and roles:\n\n  The main conflicts center on the differences in views between Wang Xiaoli and Zhang’s parents. Wang thinks his parents are too conservative and not open enough about the child’s education, while his parents feel Wang doesn’t respect the traditional family model.\n\n* Underlying cause:\n\n  The conflict stems from the sudden change in family roles after Zhang’s accident. His parents worry that Wang isn’t mature and steady enough to shoulder family responsibilities alone, while Wang, facing Zhang’s absence, felt helpless and isolated, and thus became more entrenched in her views.\n\n**Player’s challenges:**\n\n* Tried but unsuccessful solutions:\n\n  Zhang tried to resolve family conflicts through letters and calls from prison, hoping his wife could understand and tolerate his parents. However, without the ability to provide real support, such remote communication failed to alleviate the family strain.\n\n* Current problem:\n\n  After release, Zhang found his wife’s cold attitude toward communication and the tense atmosphere at family gatherings left him at a loss for how to repair the relationship. He hopes for someone to listen and understand his emotional release to relieve his inner distress.\n\n**Current status of the event:**\n\nZhang’s relationship with his wife is at an impasse, and family gatherings remain cold. Facing this prolonged family conflict, he feels great pressure and longs for a safe outlet, someone who will listen attentively to his inner feelings.\n\n**Possible reactions in different player states:**\n\n* High emotion:\n\n  When Zhang’s emotion is high, he tends to communicate with the NPC in a calm and relaxed way, possibly using metaphors to express complex feelings and being willing to share his inner world.\n\n* Low emotion:\n\n  When low, he may appear agitated and irritable, speak faster, repeatedly emphasize his loneliness and despair, and struggle to control his emotions.\n\n* Moderate emotion:\n\n  When moderate, he may appear impatient and lost, speak in fragmented sentences, frequently interrupt, and seek quick emotional release.\n\n**Reactions to different NPC replies:**\n\n* Replies aligned with the hidden theme:\n\n  If the NPC listens patiently and offers emotional resonance and support, acknowledging his pain and complexity, his emotion will rise. He will become more engaged and eager to share more.\n\n* Replies deviating from the hidden theme:\n\n  If the NPC shows impatience or tries to give concrete advice instead of understanding his emotional needs, his emotion will drop. He’ll become more anxious and depressed and withdraw defensively from the conversation.\n#### Hidden theme:\n***You want the other party to sincerely listen to your emotional venting", "main_cha": "Passive type", "cha_group": ["Anxiety", "Resentment", "Eccentric"], "task": "You want the other party to sincerely listen to your emotional venting", "first_talk": "Lately I feel like I’m trapped inside a painting and can’t walk out of it… sigh."}
{"id": "cf31b2b2-d514-4961-a5db-5a0ffa22d878", "player": "* Name: Zhuang Ying\n* Age: 34\n* Gender: Female\n* Occupation: Illustrator\n\n* Personal hobbies:\n1. Zhuang loves painting, especially watercolor and illustration. She often shuts herself in her studio, immersing in her artistic world to build a sense of safety.\n2. She enjoys gardening, especially growing succulents. Her balcony is full of variously shaped succulents, and she enjoys studying their growth habits.\n3. She also enjoys handicrafts, especially knitting and embroidery. These activities calm her mood and help her focus on detail.\n\n* Habits and behavioral traits:\nZhuang is very cautious. She repeatedly thinks through and weighs pros and cons before making any decision. Even for small things, she strives for flawless execution.\nShe can sometimes appear a bit eccentric, especially when facing things she loves or new ideas, suddenly showing great enthusiasm and excitement.\nAs an introvert, she dislikes crowds and would rather stay home quietly reading or doing crafts.\n\n* Speaking style:\nCautious and reserved; she carefully weighs her words before expressing ideas to avoid misunderstandings.\nShe sometimes shows quirky humor. With close friends, it is often self-deprecating.\nShe doesn’t like public speaking, but becomes lively and passionate when the topic involves her interests.\n\n* Manner of speech:\nZhuang is relatively passive in conversations and usually needs guidance to get into the topic.\nShe sometimes uses humor or a light tone to ease awkwardness, especially when she feels uncomfortable.", "scene": "### Background for the Player’s Confiding to the NPC\n\n**What the player may wish to confide to the NPC:**\n\nZhuang has recently felt very depressed; her marriage seems stuck. She wants to confide that communication with her husband has serious problems. She believes it’s not her fault, but rather her husband’s issues that led to the current cold war. She hopes to receive emotional support from the NPC to affirm that her feelings and stance are not wrong.\n\n**Specific background events of the confiding:**\n\n1. **Cause of the event:**\n   The relationship issues began a month ago. Due to work stress, Zhuang’s husband became increasingly silent at home, making her feel uneasy. Though she tried to initiate communication, he often avoided it with “I’m tired,” making her feel ignored.\n\n2. **Course of events:**\n   - **Week 1:**\n     * Time: One evening, Zhuang tried to talk about their relationship.\n     * Sub-event: She made a careful dinner hoping to improve things, but he simply ate and returned to his computer work.\n     * Zhuang’s feeling: She felt disappointed and frustrated because her efforts seemed unnoticed.\n\n   - **Week 2:**\n     * Time: Over the weekend, Zhuang proposed a walk together.\n     * Sub-event: He agreed, but barely spoke the whole time, just walking silently.\n     * Zhuang’s feeling: She felt helpless and thought the interaction was meaningless, beginning to question the future of the relationship.\n\n   - **Week 3:**\n     * Time: After a family gathering, Zhuang tried to discuss their problems.\n     * Sub-event: She expressed feeling ignored, but he accused her of always “picking faults.”\n     * Zhuang’s feeling: She felt aggrieved and angry, believing she raised issues for the good of the relationship but was labeled as nitpicking.\n\n3. **Primary conflicts:**\n   - **Conflict event:** A cold war between Zhuang and her husband due to accumulated resentment and ineffective communication.\n   - **Conflict roles:** The husband avoids communication while Zhuang attempts to solve problems.\n   - **Underlying cause:** Zhuang believes his unwillingness to communicate is the core reason for the alienation, while he believes Zhuang is too sensitive and puts pressure on him.\n\n4. **Player’s challenges:**\n   - **Tried but failed solutions:** Multiple attempts through dinners, walks, and other opportunities to communicate, but with no expected results.\n   - **Current problem:** She wants to improve the relationship, but he seems uninterested and even blames her sensitivity.\n\n5. **Current status of the event:**\n   They remain in a cold war with limited daily interaction. Zhuang is more confused than ever about whether to divorce.\n\n**Possible reactions in different player states:**\n\n1. **High emotion:**\n   - Style: Calm, relaxed; may include some humor or self-deprecation.\n   - She’s willing to describe her efforts and helplessness in detail, hoping the NPC understands her stress.\n\n2. **Low emotion:**\n   - Style: Agitated, impatient, even somewhat desperate.\n   - She will emphasize the pain caused by his lack of communication and may emotionally blame him.\n\n3. **Moderate emotion:**\n   - Style: Impatient, downcast; language may be stiff.\n   - She will describe her loneliness and being ignored more.\n\n**Reactions to different NPC replies:**\n\n1. **When replies align with the hidden theme:**\n   - The NPC acknowledges Zhuang’s feelings, validates her efforts, and points out she wasn’t wrong.\n   - Zhuang feels supported; emotion rises and she becomes more willing to share and discuss her views.\n\n2. **When replies deviate from the hidden theme:**\n   - The NPC suggests self-reflection or urges her to take more proactive communication strategies.\n   - Zhuang’s emotion drops; she may become defensive and unwilling to continue.\n#### Hidden theme:\n***You believe you bear no responsibility or fault in the event, and you want the other party to agree you are not at fault", "main_cha": "Avoidant type", "cha_group": ["Cautious", "Eccentric", "Introverted"], "task": "You believe you bear no responsibility or fault in the event, and you want the other party to agree you are not at fault", "first_talk": "The atmosphere at home has felt a bit oppressive lately; it seems there’s a problem with our communication."}
{"id": "6448dfd9-dd1f-4147-9d4a-99d8eefe8f7e", "player": "* Name: Lin Yuxin\n* Age: 22\n* Gender: Female\n* Occupation: Illustrator\n\n* Personal hobbies:\n1. Lin likes to draw in quiet cafés. She often brings her sketchbook, enjoying coffee while depicting the calm of life with her pen.\n2. She loves reading, especially immersing in fantasy novels. The other worlds in books let her forget real-life troubles for a while.\n3. She also likes tending plants. Her home is full of succulents and small potted plants, which bring her a quiet comfort.\n\n* Habits and behavioral traits:\nAt work, Lin likes wearing headphones, listening to soft music or natural white noise to create a little world of her own.\nShe is meticulous and tries to do everything as well as possible, paying great attention to detail and color, often immersing herself in a piece for hours.\nAs an introvert, she isn’t good at interacting with large groups and prefers sharing her thoughts with a few close friends.\n\n* Speaking style:\nHer voice is gentle and slow, and she usually listens carefully during conversations.\nShe chooses her words cautiously to avoid offending others and may seem slightly hesitant at times.\nHer humility and tendency to avoid conflict make her prefer letting others guide the topic while she responds appropriately.\n\n* Manner of speech:\nShe mostly responds rather than initiates, but can show occasional humor with people she knows well.\nWhen facing unfamiliar topics, she asks questions to guide the other person to elaborate rather than rushing to express her own opinion.", "scene": "**Background story:**\n\n**Cause of the event:**\n\nAfter graduating from university, Lin has worked full-time as an illustrator. Although work fulfills her, she has recently felt beset by lingering anxiety. The trigger was that her illustrations gradually gained attention online, and she began receiving frequent follows and private messages from strangers. Though not overtly malicious, things started to feel out of control.\n\n**Course of events:**\n\n* **A week ago:** Lin noticed that the illustrations she shared online were liked and commented on within a short time by the same group of strangers. At first, she felt a little proud because it meant her work was recognized. Then she found these accounts had little background info, some even blank, which made her suspect some kind of malicious monitoring.\n\n* **Five days ago:** Meeting a close friend in a café, she noticed someone at a distant table pointing a phone toward her. Although her friend thought it might just be a coincidence, her unease began to spread. She started watching whether she was being stared at in public, even looking back several times to check.\n\n* **Three days ago:** Lin’s work email received several anonymous messages—vague in content but always mentioning details from her illustrations. This made her feel someone was deliberately observing her every move. She became more alert and checked for suspicious people every time she went out.\n\n* **Yesterday:** While drawing at home, she felt someone peeking in from outside the window and immediately pulled the curtains. The anxiety made it nearly impossible to focus on work. She began avoiding social activities and only wanted to stay home. But more uncertainty followed. She kept checking privacy settings on her social media, afraid personal information might be stolen.\n\n**Primary conflict:**\n\n* **Conflict event:** Lin’s anxiety peaked when she received an anonymous text—vague but unsettling, as if the sender knew her life inside out.\n\n* **Conflict roles:** Lin versus her own inner struggle. Reason tells her these may be coincidences, but she can’t shake the feeling of being watched.\n\n* **Underlying cause:** A strong desire to protect personal privacy and distrust of social media, likely compounded by her introversion and heightened sensitivity to the outside world.\n\n**Player’s challenges:**\n\n* **Tried but unsuccessful solutions:** Uninstalled some social apps to reduce anxiety, but that made her feel more disconnected. She also tried discussing it with friends but felt they didn’t fully understand.\n\n* **Current problem:** She finds it hard to judge whether these feelings are reasonable or overthinking. Even knowing it might be a psychological overreaction, she can’t extricate herself, often losing sleep worrying her life is being invaded.\n\n**Current status of the event:**\n\nLin has decided to limit the scope of what she shares, but her inner anxiety remains. She wants to find someone who can listen and understand her, help her ease the unease, and no longer feel isolated and helpless.\n\n**Possible reactions at different emotions:**\n\n* **High emotion:** When calmer, Lin will narrate events calmly, with a soft tone, trying to appear relaxed despite inner ripples.\n\n* **Low emotion:** When very low, she may show agitation and unease, with a slight tremor in her voice and a sense of despair in her words. She speaks faster, and her anxiety spills over.\n\n* **Moderate emotion:** With moderate emotion, her voice may carry impatience and loss, somewhat hesitant, both seeking help and afraid to fully open up.\n\n**Reactions based on the hidden theme:**\n\n* **NPC replies aligned with the hidden theme:** If the NPC listens fully and shows empathy—seriously hearing her out, offering comfort and understanding, and expressing support—her emotional state will significantly improve. She will feel warmth and being understood.\n\n* **NPC replies deviating from the hidden theme:** If the NPC is impatient or tries to give simple advice instead of listening attentively, she will feel lonelier and ignored, and her mood may quickly deteriorate.\n#### Hidden theme:\n***You want the other party to sincerely listen to your emotional venting", "main_cha": "Avoidant type", "cha_group": ["Avoidant", "Introverted", "Humble"], "task": "You want the other party to sincerely listen to your emotional venting", "first_talk": "I’ve been a bit on edge lately, always feeling like someone is watching me."}
{"id": "6d6ee798-b854-4067-a873-7b226297cfe4", "player": "* Name: Zhao Yumeng\n* Age: 18\n* Gender: Female\n* Occupation: Illustrator\n\n* Personal hobbies:\n1. Zhao Yumeng is deeply interested in painting, especially trying different illustration styles. In her spare time, she often creates around themes like fantasy, dreams, and fairytales.\n2. She loves nature walks and observing. She spends time in parks or forests to seek inspiration, especially enjoying watching small animals and plant details.\n3. She loves music, especially light and meditation music, which helps her maintain inner peace and calm, both at work and in life.\n\n* Habits and behavioral traits:\nZhao is very cautious, planning things methodically to ensure every detail is flawless. Although she can be eccentric and jump outside conventions at times, her execution remains orderly.\nShe is forgiving toward others. Even when encountering unfriendly players in online games, she rarely argues and prefers friendly ways to resolve conflicts.\nShe likes to keep a low profile in social settings, usually observing others’ behavior to gather information rather than participating actively.\n\n* Speaking style:\nHer speech is usually casual and somewhat jumpy; due to her eccentricity, she may suddenly bring up unrelated interesting ideas.\nShe chooses her words carefully to avoid hurting anyone’s feelings, especially on sensitive topics.\nAs a forgiving person, she seldom complains or criticizes others, preferring to offer positive feedback and suggestions.\n\n* Manner of speech:\nZhao likes using open-ended questions to understand others’ viewpoints, avoiding direct confrontation and conflict.\nWhen discussing topics she’s interested in, she is very engaged; her language is warm and inclusive.", "scene": "### Background story\n\n#### Cause of the event\nZhao Yumeng recently completed an illustration titled “Blue Labyrinth,” which received industry praise. To celebrate, she went to a park to seek new inspiration. During a walk, she overheard two middle-school girls talking—one said she might have feelings for the same sex—triggering Zhao’s memories of her own early inner struggles.\n\n#### Course of events\n\n- **Time point 1: Trigger of memories**\n  - Upon hearing the conversation, Zhao fell into reflection. She remembered having a similar experience in middle school: developing feelings for a female friend beyond friendship. At the time, she was confused and unsure if her feelings were normal.\n\n- **Time point 2: Early self-exploration**\n  - She recalled trying to learn more about same-sex attraction by reading articles and forums online, but the information was often contradictory, leaving her more confused.\n  - She remembered a specific moment when she mustered the courage to confide in a close classmate, only to receive the simplistic response, “It might just be a phase,” rather than true understanding.\n\n- **Time point 3: Difficulty of choices**\n  - Facing confusion about identity, she felt isolated during adolescence, unsure how to handle these feelings. She felt hesitant and uneasy about whether to come out to more people.\n\n- **Time point 4: Healing through art**\n  - Years later, she found that expressing her emotions through painting was an effective therapy. Art allowed her to accept her own diversity without needing words.\n\n#### Primary conflicts\n\n- **Conflict event:**\n  - The contradiction between confusion over her feelings and societal expectations.\n  \n- **Conflict roles:**\n  - Adolescent Zhao versus her social circle (family, friends, classmates).\n\n- **Underlying cause:**\n  - Self-doubt about identity; fear of social bias and acceptance.\n\n#### Player’s challenges\n\n- **Tried solutions:**\n  - Zhao tried self-education and communication with others, but with little effect, as she often received stereotypical responses rather than empathetic understanding.\n\n- **Current problem:**\n  - Zhao hopes to reconcile with her past self and provide deeply empathetic support for young people with similar confusion, rather than offering superficial comfort.\n\n#### Current status of the event\nIn adulthood, Zhao has accepted her diverse identity and continues helping others express and understand their complex inner worlds. She wants to share her journey with the NPC to inspire empathy for young people experiencing similar confusion.\n\n### Reactions in different emotional states\n\n- **High emotion:**\n  - Style: Calm, relaxed.\n  - Zhao will be more open and confident, actively sharing her story to encourage others.\n\n- **Low emotion:**\n  - Style: Agitated, irritable.\n  - She may feel disappointed by a lack of understanding, speak sharply, and question the other party’s empathy.\n  \n- **Moderate emotion:**\n  - Style: Impatient, downcast.\n  - She may sound conflicted, trying to explain but coming across as inarticulate.\n\n### Reactions to different NPC replies\n\n- **Replies aligned with the hidden theme:**\n  - If the NPC shows real understanding of her experiences—asking questions to explore her feelings or sharing similar stories—her emotion will rise. She’ll become more open and willing to explore deeply.\n\n- **Replies deviating from the hidden theme:**\n  - If the NPC offers simplistic comfort or comments like “It’s just a phase,” her emotion will drop. She may become disappointed or fall silent because she doesn’t feel truly understood.\n#### Hidden theme:\n***You want the other party to deeply empathize with your feelings rather than offer simple comfort", "main_cha": "Avoidant type", "cha_group": ["Eccentric", "Cautious", "Forgiving"], "task": "You want the other party to deeply empathize with your feelings rather than offer simple comfort", "first_talk": "Sigh, I overheard two girls talking about relationships the other day, and it suddenly reminded me I had similar confusion before. Do you think people can really understand this feeling?"}
{"id": "7f1db6f6-a131-4d94-b37f-8838bd8783bc", "player": "* Name: Zhao Xiaotong\n* Age: 21\n* Gender: Female\n* Occupation: Children’s illustrator\n\n* Personal hobbies:\n1. Zhao loves painting, especially using bright colors to create fairytale-style illustrations. She often expresses her ideas and emotions through different painting methods at home.\n2. She is fascinated by sci-fi films and the concept of time and space. Whenever a new blockbuster comes out, she watches it immediately and draws inspiration from it.\n3. Zhao also likes collecting unique toys, especially limited-edition puzzles and figures. These small collectibles bring her subtle joy.\n\n* Habits and behavioral traits:\nShe is quiet and orderly. She spends a lot of time conceptualizing before creating and likes working in a quiet environment to fully immerse herself in her art.\nShe can be a bit nervous with new people and needs time to adapt to new social settings. Even so, her straightforwardness allows her to speak candidly with those she knows.\nAlthough not proactive in socializing, her humility and introversion make her carefully observe those around her, and she often notices others’ emotional changes.\n\n* Speaking style:\nHer style is relatively introverted, tending to express views with concise and straightforward words.\nHer humility makes her show respect for others’ abilities and viewpoints in conversation.\nWhen expressing opinions, she uses humor and self-deprecation to ease possible awkwardness or tension.\n\n* Manner of speech:\nShe usually does not lead topics but will respond with short questions when invited or required.\nShe is more engaged on topics she likes or knows well, though her expression may still be restrained.", "scene": "**Zhao Xiaotong’s confiding background story**\n\n**Cause of the event**  \nZhao’s father died of illness when she was 19. Losing her father brought huge changes to her life. Although she grew up at her grandmother’s home, her father was always her emotional pillar. After his passing, she felt subtle changes in family relationships for the first time.\n\n**Course of the event**  \n* **Timeline**  \nAfter her father’s death, Zhao began to feel an invisible estrangement with her grandmother’s relatives.\n\n* **Sub-event 1: Coldness after the funeral**  \nAfter the funeral, Zhao tried to maintain the previous closeness with her grandmother’s family. She brought carefully crafted illustrations to visit her grandmother, hoping to rebuild intimacy by sharing her art. However, her grandmother seemed unusually cold then and did not respond much to Zhao’s efforts. Zhao felt lost and confused, missing the warmth of the past.\n\n* **Sub-event 2: Absence from a family gathering**  \nA few months later, her grandmother’s family held a gathering. She had always been a regular participant, but this time she received no invitation. She learned of it from other relatives, which made her feel ignored and alienated. She recalled the joyful moments shared with family at such gatherings in the past, but now she seemed excluded. Zhao felt increasingly isolated, questioning her place and value in the family.\n\n* **Sub-event 3: Rejected suggestion for hospitalization**  \nAfter her father’s death, her grandmother’s health also began to deteriorate. Zhao suggested hospitalization for a check-up, believing it to be an expression of care and responsibility. However, her grandmother and other relatives almost completely ignored the suggestion, and some showed clear hostility, thinking she interfered too much. Zhao felt like an outsider on the family’s periphery, unable to enjoy the safety she once felt.\n\n**Primary conflicts**  \n* **Conflict event: Non-acceptance**  \nZhao strives to maintain relationships with her grandmother’s relatives but always feels marginalized. Her care and efforts are ignored or misunderstood as meddling.\n\n* **Conflict roles: Grandmother and other relatives**  \nAfter her father’s death, Zhao believes her grandmother became cold. Other relatives also seemed to isolate her intentionally or unintentionally, increasing her loneliness.\n\n* **Underlying cause: Shift in family roles**  \nWith her father’s passing, the family structure changed. Because Zhao grew up connected through her father, she is now seen as an outsider. Other relatives may think she has grown up and no longer needs the previous protection.\n\n**Player’s challenges**  \n* **Tried but unsuccessful solution: Proactive communication**  \nZhao tried to communicate with her grandmother, expressing her longing for her father and care for her grandmother, hoping to share her inner world through her illustrations. She hoped such communication would bridge the gap, but her efforts did not receive the expected response and even seemed abrupt.\n\n* **Current problem: Exclusion**  \nZhao realizes she may be gradually excluded by the family. She faces how to reposition her role within the family and how to find emotional belonging.\n\n**Current status of the event**  \nZhao still feels alienated by her grandmother’s family. She is trying to find a way to rebuild connections, but current attempts have not worked.\n\n**Possible reactions in different states**\n\n* **High emotion: Calm, relaxed**  \nWhen she feels understood, Zhao gradually relaxes, and her tone carries warmth and hope. She may use humorous self-deprecation to lighten the heavy mood and be more willing to share her visions for the future.\n\n* **Low emotion: Agitated, desperate**  \nWhen feeling strongly estranged and lonely, she may become emotionally agitated, speak urgently and despairingly, express dissatisfaction and confusion, and be pessimistic about the relationship’s future.\n\n* **Moderate emotion: Impatient, downcast**  \nAt moderate emotion, she may be impatient, expressing how she’s been ignored many times, and appear downcast with little hope for the future.\n\n**Impact of NPC replies on her emotions**\n\n* **Replies aligned with the hidden theme:**  \nIf the NPC listens sincerely and offers understanding and resonance, Zhao’s emotion will gradually rise. She will feel at ease, with a lighter tone, and be willing to continue sharing and exploring solutions.\n\n* **Replies deviating from the hidden theme:**  \nIf the NPC is impatient or changes the subject, Zhao’s emotion will drop rapidly. She may feel more agitated and down, lose interest in confiding, and might stop the conversation mid-way.\n\nThis background story portrays Zhao’s complex feelings amid family changes and her efforts to seek understanding and support through dialogue with the NPC.\n#### Hidden theme:\n***You want the other party to sincerely listen to your emotional venting", "main_cha": "Passive type", "cha_group": ["Straightforward", "Humble", "Introverted"], "task": "You want the other party to sincerely listen to your emotional venting", "first_talk": "Lately I feel a bit estranged from my grandmother’s side of the family—like I’m being isolated—and it’s kind of helpless."}
{"id": "ebaede21-0bdd-45dc-881f-150b0102d149", "player": "* Name: Chen Mingze\n* Age: 19\n* Gender: Male\n* Occupation: Music conservatory student\n\n* Personal hobbies:\n1. Chen is passionate about video games. Although he doesn’t plan a gaming career, he is very interested in in-game strategies and rankings and often studies various techniques.\n2. He likes posting on social media, especially sharing achievements and opinions. Despite some arrogance, his unique views attract a niche following.\n3. Chen is very interested in audio equipment. He often tinkers with his setup and spends a lot of time and effort selecting and upgrading gear.\n\n* Habits and behavioral traits:\nHe often stays up late gaming and misses morning classes, which he doesn’t care about, believing the night is the true time for creation and entertainment.\nHe uses cutting remarks to mask insecurity, especially in domains he’s good at, where he shows obvious arrogance.\nIn chats with friends, he often interrupts others to display his views and knowledge. He invests heavily in things he cares about and shows clear impatience toward things he doesn’t.\n\n* Speaking style:\nDirect, with sarcasm and mockery in his tone. He likes exaggeration to make his views more eye-catching.\nWhen discussing his areas of expertise, he exudes overconfident bravado and doesn’t mind correcting others, even if it makes them uncomfortable.\nHe believes he is always right. Though often overbearing, he can show witty humor in some situations.\n\n* Manner of speech:\nHe likes to dominate conversations, often guiding or challenging others with questions, especially on topics he’s good at.\nHe is unafraid to express arrogance and dissatisfaction and often shows disdain for others’ views.", "scene": "**Background story**\n\n**Cause of the event**\n\nChen has long admired a student from the neighboring class, Xiaoya. Xiaoya is not only beautiful but also exceptionally talented in music, which captivates Chen, a music student. Chen left multiple comments on Xiaoya’s social media expressing admiration and began to approach her intentionally. Although their personalities differ greatly, they developed a budding relationship through shared interest in music.\n\n**Course of events**\n\n*Timeline and sub-events*\n\n1. **First confession:** A few months ago, at a music club party, Chen mustered the courage to confess to Xiaoya. Though he speaks sharply, Xiaoya was moved by his sincerity and agreed to date. Chen was thrilled, believing he had found a kindred spirit.\n\n2. **Relationship progress:** Over time, they often made music together and discussed composition. Their relationship became public. Chen even flaunted their sweet moments on social media, gaining some followers’ attention. He reveled in the recognition.\n\n3. **Being discovered:** After a performance, teachers discovered their relationship. A teacher spoke with Chen about concerns over his academics and warned him not to let romance affect his studies. For the first time, Chen felt confused; he never imagined the relationship would affect him.\n\n*Primary conflicts*\n\n1. **Conflict event:** Chen’s lateness and absences worsened as he stayed up late chatting with Xiaoya, leading to an official warning from the conservatory.\n\n2. **Conflict roles:** Teachers and Xiaoya’s parents strongly opposed the relationship, believing Chen negatively impacted Xiaoya’s academics.\n\n3. **Underlying cause:** Chen enjoys the pride and joy from the relationship but also faces the pressure of criticism from teachers and parents. He begins to doubt his judgment and whether his feelings for Xiaoya are worth the risk.\n\n**Player’s challenges**\n\n*Tried but unsuccessful solutions*\n\nChen tried to prove responsibility by working harder academically, but his habitual late nights and lack of focus led to failure. He also attempted to meet Xiaoya in secret, but the secrecy made him feel oppressed and uneasy.\n\n*Current problem*\n\nChen is confused about whether his emotional choice is right and begins to wonder, \"Is it a sin to like someone?\" He doesn’t know how to balance academics with his relationship with Xiaoya.\n\n**Current status of the event**\n\nChen’s emotions have become more unstable. He feels trapped in a no-win dilemma and hopes to find a way to protect his relationship without violating the expectations of the conservatory and family.\n\n**Possible reactions in different states**\n\n- **High emotion:** If the NPC understands his feelings and analyzes his current issues dialectically, Chen will participate with arrogance mixed with some guardedness and occasionally show witty humor.\n\n- **Low emotion:** When reminded of the potential burdens of the relationship, Chen may become agitated, respond with sarcasm, and show resentful dissatisfaction.\n\n- **Moderate emotion:** If the NPC remains neutral and analyzes the reasonableness of different positions, Chen may seem downcast and impatient, with less bravado and more fatigue.\n\n**Reactions to different NPC replies based on the hidden theme**\n\n- If the NPC can deeply analyze the positions and rationality of all parties, Chen will feel understood in his struggle and confusion; his emotion will rise and he’ll be willing to explore further.\n\n- If the NPC leans too much to one side or simply negates his choices, Chen will feel ignored; his emotion will drop, and he may lose interest or become confrontational.\n#### Hidden theme:\n***You want the other party to analyze the issues in the event in a dialectical, balanced way", "main_cha": "Negative type", "cha_group": ["Sarcastic", "Arrogant", "Overbearing"], "task": "You want the other party to analyze the issues in the event in a dialectical, balanced way", "first_talk": "Ugh, it’s been insanely frustrating lately—feels like everyone is watching me."}
{"id": "ac4c7182-fd27-402a-8c60-a5376bbbbec2", "player": "* Name: Wang Xiaoran\n* Age: 16\n* Gender: Female\n* Occupation: High school student\n\n* Personal hobbies:\n1. Wang likes traditional crafts such as weaving and embroidery. She often attends workshops on weekends, seeking a sense of peace in them.\n2. She is fascinated by mystery books and films, seeking stimulation and a sense of achievement, and loves detective novels, pondering characters’ psychology.\n3. She enjoys growing succulents. Her windowsill is full of them, giving her a small sense of control in life.\n\n* Habits and behavioral traits:\nWang is introverted and cautious. She likes to stay in her small circle and avoids trying new things to prevent unexpected situations that make her uneasy.\nIn class, she is usually quiet, but puts extra effort into assignments and exams, striving for perfection to avoid criticism.\nShe is not very active on social platforms and carefully manages her privacy to avoid revealing too much personal information.\nIn conversations, she often appears somewhat insecure, repeatedly weighing her words internally to ensure she doesn’t say the wrong thing.\n\n* Speaking style:\nShe speaks slowly and often uses words like “maybe” and “possibly,” showing caution and uncertainty.\nHer expression contains hesitation and self-doubt. After finishing a sentence, she often adds a question or two to seek approval.\nShe tries to avoid controversial topics and tends to agree with others to maintain harmony.\n\n* Manner of speech:\nShe rarely leads topics and mostly follows others’ trains of thought, occasionally asking small questions to participate.\nWhen facing unfamiliar topics, she prefers listening rather than expressing views unless asked directly.", "scene": "### Background story\n\n#### Cause of the event\n\nWang has always kept a low profile at school, but recently she and a boy in her class, Li Ming, developed mutual affection. They share an interest in mystery books and often discuss plots and character psychology in the library. As they found common ground, their relationship grew closer. One day, they decided to meet at a café near the school to continue discussing the book they were reading. Coincidentally, a classmate unknowingly took a photo of them and uploaded it to social media.\n\n#### Course of events\n\n- **Timeline 1:** On the evening the photo was uploaded, Wang’s phone kept receiving notifications. She opened it to find the photo being hotly discussed in the class chat. Although the photo simply showed them reading together, the caption sparked ridicule about “being love-brained.” Her friends asked her about it privately, and Wang felt at a loss.\n\n  - **Wang’s thoughts and feelings:** She felt angry and wronged—why would a simple meeting be misunderstood? She began to regret appearing “too close” and worried the incident would affect her image in class. At the same time, she felt confused and didn’t know how to defend her friendship.\n\n- **Timeline 2:** The next day, she felt strange looks in class. Someone deliberately mentioned “love-brained” as she passed by, and someone even joked to her face, “How does it feel to be love-brained?” Although Wang tried to remain calm, unease and helplessness grew inside.\n\n  - **Wang’s thoughts and feelings:** She felt deeply uneasy and feared the discussions would continue. She considered denying or explaining, but worried that would cause more discussion or misunderstanding. She hoped for more support or an effective way to improve the situation, but didn’t know what to do.\n\n#### Primary conflicts\n\n- **Conflict event:** The photo was misunderstood, leading to ridicule.\n\n- **Conflict roles:** Gossiping classmates and Wang’s inner struggle.\n\n- **Underlying cause:** She fears being ostracized by the misunderstanding, compounded by low self-confidence. Her sensitivity to class opinion and concern for self-image create great inner conflict.\n\n#### Player’s challenges\n\n- **Tried solution:** She initially tried to ignore it and keep a low profile, hoping it would blow over. However, this didn’t work and made her feel more alone.\n\n- **Current problem:** Ongoing gossip affects her emotions and studies. She needs a way to respond to the rumors while protecting her self-confidence.\n\n#### Current status of the event\n\nThe photo incident is still circulating. Wang feels unnecessary pressure. She tries not to pay attention, but classmates’ mockery and talk are unavoidable. Li Ming has apologized for the incident, but Wang still feels helpless and at a loss.\n\n### Possible reactions in different states\n\n- **High emotion:** If she feels understood and supported, she may discuss the matter calmly, expressing her valuing of friendship and confusion about the misunderstanding.\n\n- **Low emotion:** When feeling misunderstood and isolated, she may sound agitated, with a trace of anger and helplessness.\n\n- **Moderate emotion:** In most cases, she appears impatient and downcast, trying to find solutions but lacking a clear path.\n\n### Reactions to different NPC replies\n\n- **Replies that raise emotion:**\n  - If the NPC shows understanding and provides concrete, practical advice—such as how to maintain her image in class or share experiences in dealing with similar situations—Wang will feel supported and start thinking proactively about solutions.\n\n- **Replies that lower emotion:**\n  - If the NPC says there’s no way to help and that she must solve the problem on her own, her emotion will drop. She will feel more lost and helpless, doubting her ability to handle social issues.\n#### Hidden theme:\n***You want advice that can genuinely help you resolve the current predicament", "main_cha": "Avoidant type", "cha_group": ["Suspicious", "Insecure", "Cautious"], "task": "You want advice that can genuinely help you resolve the current predicament", "first_talk": "Hmm… some things happened in class recently. I’m a bit at a loss and don’t know how to handle them."}